const VkBot  = require('node-vk-bot-api')
const Markup = require('node-vk-bot-api/lib/markup')

const bot = new VkBot('0598285c6ae8d9a74f0b626dbb0e3d9cc06196801898289b80d8502a7b6e95bbb5cc6dff829296b340d22')


// Приветственный текст
const welcomeText = 'Кнопки с ответами можно скрыть нажав на кнопку \&#11603;&#11603; рядом с полем для ввода текста, чтобы они не загораживали пол экрана. Вернуть кнопки с ответами можно повторно нажав кнопку \&#11603;&#11603;' +
'\n' +
'\n' +
'Приветствую тебя путник, мнея зовут Захир, я хранитель знаний группы "Нагваль дао" во Вконтакте. Что тебя интересует?' +
'\n' +
'\n' +
'Если ты только знакомишься с деятельностью нашей группы, то рекомендую почитать методичку "Новое Начало", ее можно получить нажав на кнопку "С чего начать?"' +
'\n' +
'\n' +
'Если ты уже бывалый воин, когда-то получал посвящение, затем долгое премя путешевствовал по разным мирам и пространствам, вернувшись в наш бренный мир решил заглянуть к нам на огонек и узнать, что сейчас практикуют Воины Нагваль Дао, то нажмай кнопку "Актуальная практика". Здесь ты найдешь настоящее живое знание, с помошью которого ты сможешь сонастроиться с походом в настоящий момент.' +
'\n' +
'\n' +
'Книги' +
'\n' +
'\n' +
'Цитаты' +
'\n' +
'\n' +
'Совместные практики'

// Основная клавиатура
const mainKeyboard = Markup.keyboard([
  [
    Markup.button('С чего начать?', 'primary')
  ],
  [
    Markup.button('Актуальная практика', 'primary')
  ],
  [
    Markup.button('Наши книги', 'primary')
  ],
  [
    Markup.button('Мотиваия', 'primary')
  ],
  [
    Markup.button('Совместные практики', 'primary')
  ]
]).oneTime()

// Завершение диалога
const endDialog = Markup.keyboard([
  [
    Markup.button('Меня интересует еще кое-что', 'primary')
  ],
  [
    Markup.button('Благодарю, Захир!', 'positive')
  ]
]).oneTime()


// Начать
bot.command('Привет', (ctx) => {
  ctx.reply(
  welcomeText,
  null,
  mainKeyboard
  )
})

// Захир
bot.command('Захир', (ctx) => {
  ctx.reply('Приветствую тебя Воин, что тебя интересует?',
  null,
  mainKeyboard
  )
})

// Меня интересует еще кое-что
bot.command('Меня интересует еще кое-что', (ctx) => {
  ctx.reply('Что тебя интересует?',
  null,
  mainKeyboard
  )
})

// С чего начать
bot.command('С чего начать', (ctx) => {
  ctx.reply('Я рекомендую тебе изучить нашу методичку "Новое Начало". В ней описана наша философия и фундаментальные практики. Усердно занимаясь по ней, ты станешь сильным Воином и подготовишься к будующим великим свершениям и прорывам!',
  [
    'doc-149932889_513948567',
    'doc-149932889_513948490'
  ],
  endDialog
  )
})

// Актуальная практика
bot.command('Актуальная практика', (ctx) => {
  ctx.reply('На данный момент актуальная практика описана в статье "Работа по сторонам света и выстраивание тоналя".',
  'doc-149932889_513008945',
  endDialog
  )
})

// Благодарю, Захир
bot.command('Благодарю, Захир', (ctx) => {
  ctx.reply('Рад был помочь тебе Воин!',
  null,
  Markup.keyboard([
    Markup.button('Захир')
  ]).oneTime()
  )
})


bot.startPolling(() => {
  console.log('Бот запущен...')
})